tap "derailed/k9s"
tap "hashicorp/tap"
tap "homebrew/bundle"
# Client for Amazon Elastic Beanstalk web service
brew "aws-elasticbeanstalk"
# Core application library for C
brew "glib"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Prevent cloud misconfigurations during build-time for IaC tools
brew "checkov"
# Docker Credential Helper for Amazon ECR
brew "docker-credential-helper-ecr"
# Render markdown on the CLI
brew "glow"
# OpenType text shaping engine
brew "harfbuzz"
# Kubernetes package manager
brew "helm"
# Cost estimates for Terraform
brew "infracost"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Development kit for the Java programming language
brew "openjdk"
# Centralized server for distributed coordination of services
brew "zookeeper"
# Open-source distributed event streaming platform
brew "kafka"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Java-based project management
brew "maven"
# Open source relational database management system
brew "mysql-client"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Drop-in replacement for Terraform. Infrastructure as Code Tool
brew "opentofu"
# Tool to automatically fix PHP coding standards issues
brew "php-cs-fixer"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# YAML framework for Python
brew "pyyaml"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Tool to generate documentation from Terraform modules
brew "terraform-docs"
# Detect compliance and security violations across Infrastructure as Code
brew "terrascan"
# Terraform version manager inspired by rbenv
brew "tfenv"
# Linter for Terraform files
brew "tflint"
# Static analysis security scanner for your terraform code
brew "tfsec"
# Update version constraints in your Terraform configurations
brew "tfupdate"
# Terragrunt version manager inspired by tfenv
brew "tgenv"
# Vulnerability scanner for container images, file systems, and Git repos
brew "trivy"
# Internet file retriever
brew "wget"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "derailed/k9s/k9s"
# Cross-platform Git credential storage for multiple hosting providers
cask "git-credential-manager"
